primer_proyecto/app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Roberto', 'González', 'roberto23', 'roberto23@gmail.com', '$2y$10$B12lZN4RK9Y2oJ8gFwU88e2OTC04fmsj98gP9/p2VZgi7JTk087lO')
---
                echo view('front/footer_view');
            } else {
                // El usuario no existe, guárdalo en la base de datos
                $formModel->save([
                    'nombre' => $this->request->getVar('nombre'),
                    'apellido' => $this->request->getVar('apellido'),
                    'usuario' => $this->request->getVar('usuario'),
                    'email' => $this->request->getVar('email'),
                    'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
                ]);